Kamurasi-Jordan-Arthur/1621_Light_RF/bt_spc5x-redesign/Scr/bt_SPC51_SM.c
//$file${SMs::./Scr::bt_SPC51_SM.c} vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv
//
// Model: bt_SPC5x_SM.qm
// File:  ${SMs::./Scr::bt_SPC51_SM.c}
//
// This code has been generated by QM 7.0.1 <www.state-machine.com/qm>.
// DO NOT EDIT THIS FILE MANUALLY. All your changes will be lost.
//
// Copyright (c) 2005 Quantum Leaps, LLC. All rights reserved.
//
//                 ____________________________________
//                /                                   /
//               /    GGGGGGG    PPPPPPPP   LL       /
//              /   GG     GG   PP     PP  LL       /
//             /   GG          PP     PP  LL       /
//            /   GG   GGGGG  PPPPPPPP   LL       /
//           /   GG      GG  PP         LL       /
//          /     GGGGGGG   PP         LLLLLLL  /
//         /___________________________________/
//
// SPDX-License-Identifier: GPL-3.0-or-later
//
// This generated code is open-source software licensed under the GNU
// General Public License (GPL) as published by the Free Software Foundation
// (see <https://www.gnu.org/licenses>).
//
// NOTE:
// The GPL does NOT permit the incorporation of this code into proprietary
// programs. Please contact Quantum Leaps for commercial licensing options,
// which expressly supersede the GPL and are designed explicitly for
// closed-source distribution.
//
// Quantum Leaps contact information:
// <www.state-machine.com/licensing>
// <info@state-machine.com>
//
//$endhead${SMs::./Scr::bt_SPC51_SM.c} ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
#include "em_common.h"
#include <stdio.h>

#include "app_assert.h"
#include "sl_sleeptimer.h"

#include "sl_bluetooth.h"
#include "gatt_db.h"


#include "app_button_press.h"
#include "sl_simple_button.h"
#include "sl_simple_button_instances.h"

#include "sl_simple_led.h"
#include "sl_simple_led_instances.h"

#include "qpc.h"
#include "app.h"

#include "bt_SPC51_SM.h"
#include "bsl_firmware_update.h"

#include <stdio.h>


//$skip${QP_VERSION} vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv
// Check for the minimum required QP version
#if (QP_VERSION < 730U) || (QP_VERSION != ((QP_RELEASE^4294967295U)%0x2710U))
#error qpc version 7.3.0 or higher required
#endif
//$endskip${QP_VERSION} ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
//$define${SMs::bt_SPC51_inst} vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv

//${SMs::bt_SPC51_inst} ......................................................
bt_SPC51 bt_SPC51_inst;
//$enddef${SMs::bt_SPC51_inst} ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

//static ToastOven l_oven; // the only instance of the ToastOven class

// global-scope definitions -----------------------------------------
QMsm * const QMsm_bt_SPC51_p = &bt_SPC51_inst.super; // the opaque pointer

//$define${SMs::bt_SPC51} vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv

//${SMs::bt_SPC51} ...........................................................

//${SMs::bt_SPC51::ctor} .....................................................
void bt_SPC51_ctor(bt_SPC51 * const me) {
    //remoteSM *me = &remote_inst;
    QMsm_ctor(&me->super, Q_STATE_CAST(&bt_SPC51_initial));


}

//${SMs::bt_SPC51::Host_BSL_writeMemory} .....................................
void bt_SPC51_Host_BSL_writeMemory(bt_SPC51 * const me) {
    //Indicate progress
    LED_DEB

    uint16_t ui16DataLength;
    uint16_t ui16PayloadSize;
    uint16_t ui16PacketSize;
    uint32_t ui32CRC;

    if (me->ui16BytesToWrite >= MAX_PAYLOAD_DATA_SIZE)
        ui16DataLength = MAX_PAYLOAD_DATA_SIZE;
    else
        ui16DataLength = me->ui16BytesToWrite;

    me->ui16BytesToWrite -= ui16DataLength;

    // Add (1byte) command + (4 bytes)ADDRS = 5 bytes to the payload
    ui16PayloadSize = (CMD_BYTE + ADDRS_BYTES + ui16DataLength);

    BSL_TX_buffer[0] = PACKET_HEADER;
    BSL_TX_buffer[1] = LSB(ui16PayloadSize);  // typically 4 + MAX_PAYLOAD SIZE
    BSL_TX_buffer[2] = MSB(ui16PayloadSize);
    BSL_TX_buffer[3] = (uint8_t) CMD_PROGRAMDATA;
    *(uint32_t *) &BSL_TX_buffer[HDR_LEN_CMD_BYTES] = me->TargetAddress;

    // Bump up the target address by 2x the number of bytes sent for the next packet
    me->TargetAddress += ui16DataLength;

    // Copy the data into the BSL_RX_buffer
    memcpy(&BSL_TX_buffer[HDR_LEN_CMD_BYTES + ADDRS_BYTES], me->data,
        ui16DataLength);

    me->data += ui16DataLength;

    // Calculate CRC on the PAYLOAD
    ui32CRC = softwareCRC(&BSL_TX_buffer[3], ui16PayloadSize);

    // Calculate the packet length
    ui16PacketSize = HDR_LEN_CMD_BYTES + ADDRS_BYTES + ui16DataLength;

    // Insert the CRC into the packet at the end
    *(uint32_t *) &BSL_TX_buffer[ui16PacketSize] = ui32CRC;

    // Write the packet to the target
    me->sc = sl_iostream_write(SL_IOSTREAM_STDIN , BSL_TX_buffer, ui16PacketSize + CRC_BYTES);
    app_assert_status(me->sc);
    bsl_read = BYTE_ACK;

}

//${SMs::bt_SPC51::SM} .......................................................
QState bt_SPC51_initial(bt_SPC51 * const me, void const * const par) {
    //${SMs::bt_SPC51::SM::initial}
    (void)par; // unused parameter
    me->advertising_set_handle = 0xff;

    static QMTranActTable const tatbl_ = { // tran-action table
        &bt_SPC51_INITIALIZING_s, // target state
        {
            Q_ACTION_NULL // zero terminator
        }
    };
    return QM_TRAN_INIT(&tatbl_);
}

//${SMs::bt_SPC51::SM::INITIALIZING} .........................................
QMState const bt_SPC51_INITIALIZING_s = {
    QM_STATE_NULL, // superstate (top)
    Q_STATE_CAST(&bt_SPC51_INITIALIZING),
    Q_ACTION_NULL, // no entry action
    Q_ACTION_NULL, // no exit action
    Q_ACTION_NULL  // no initial tran.
};
//${SMs::bt_SPC51::SM::INITIALIZING}
QState bt_SPC51_INITIALIZING(bt_SPC51 * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        //${SMs::bt_SPC51::SM::INITIALIZING::sl_bt_evt_system_boot_id}
        case sl_bt_evt_system_boot_id: {
            //Stack verion display
            app_log_info("Stack version: %u.%u.%u\r\r\n",
                       event->data.evt_system_boot.major,
                       event->data.evt_system_boot.minor,
                       event->data.evt_system_boot.patch);


