Kamurasi-Jordan-Arthur/1621_Light_RF/bt_spc5x-redesign/Scr/bt_SPC51_SM.c
            /* Print Bluetooth address */
            app_log_info("Bluetooth %s address: %02X:%02X:%02X:%02X:%02X:%02X\r\n",
                             me->address_type ? "static random" : "public device",
                             me->address.addr[5],
                             me->address.addr[4],
                             me->address.addr[3],
                             me->address.addr[2],
                             me->address.addr[1],
                             me->address.addr[0]);
                // Pad and reverse unique ID to get System ID.
                me->system_id[0] = me->address.addr[5];
                me->system_id[1] = me->address.addr[4];
                me->system_id[2] = me->address.addr[3];
                me->system_id[3] = 0xFF;
                me->system_id[4] = 0xFE;
                me->system_id[5] = me->address.addr[2];
                me->system_id[6] = me->address.addr[1];
                me->system_id[7] = me->address.addr[0];

            me->sc = sl_bt_gatt_server_write_attribute_value(gattdb_system_id,
                                                         0,
                                                         sizeof(me->system_id),
                                                         me->system_id);
            app_assert_status(me->sc);


            // setting the security mangers bits.
            me->sc = sl_bt_sm_configure(INITIAL_FLAG_CONFIG, sl_bt_sm_io_capability_displayonly);
            app_assert_status(me->sc);


            // Disabling feature exchange in peripheral role
            //uint32_t flags = 0x00000001; // 0x1 disables feature exchange in peripheral role
            //me->sc = sl_bt_system_linklayer_configure(sl_bt_system_linklayer_config_key_set_flags, sizeof(flags), (uint8_t*)&flags);
            //app_assert_status(me->sc);


            //Setting the default connection parameters for subsequent connections on peripheral
            me->sc = sl_bt_connection_set_default_parameters(CONN_INTERVAL_MIN,
                                        CONN_INTERVAL_MAX,
                                        CONN_RESPONDER_LATENCY,
                                        CONN_TIMEOUT,
                                        CONN_MIN_CE_LENGTH,
                                        CONN_MAX_CE_LENGTH);
            app_assert_status(me->sc);



            me->sc = sl_bt_advertiser_create_set(&me->advertising_set_handle);
            app_assert_status(me->sc);

            // Generate data for advertising
            me->sc = sl_bt_legacy_advertiser_generate_data(me->advertising_set_handle,
                                                     sl_bt_advertiser_general_discoverable);
            app_assert_status(me->sc);

            me->sc = sl_bt_advertiser_set_timing(
                                            me->advertising_set_handle,
                                            800U, 800U, // min & max interval (ms * 1.6)
                                            0U, 0U);    // duration, max events
            app_assert_status(me->sc);



            //Delete any preivious bonding on start up if any
            //me->sc = sl_bt_sm_delete_bondings();
            //app_assert_status(me->sc);

            //app_log_info("All bonding deleted.\n");

            //sc = sl_bt_advertiser_set_channel_map(advertising_set_handle, (uint8_t)0x01);  // Only channel 37
            // Start advertising and enable connections.




            static struct {
                QMState const *target;
                QActionHandler act[3];
            } const tatbl_ = { // tran-action table
                &bt_SPC51_OPERRATIONAL_s, // target state
                {
                    Q_ACTION_CAST(&bt_SPC51_OPERRATIONAL_e), // entry
                    Q_ACTION_CAST(&bt_SPC51_OPERRATIONAL_i), // initial tran.
                    Q_ACTION_NULL // zero terminator
                }
            };
            status_ = QM_TRAN(&tatbl_);
            break;
        }
        default: {
            status_ = QM_SUPER();
            break;
        }
    }
    return status_;
}

//${SMs::bt_SPC51::SM::OPERRATIONAL} .........................................
QMState const bt_SPC51_OPERRATIONAL_s = {
    QM_STATE_NULL, // superstate (top)
    Q_STATE_CAST(&bt_SPC51_OPERRATIONAL),
    Q_ACTION_CAST(&bt_SPC51_OPERRATIONAL_e),
    Q_ACTION_NULL, // no exit action
    Q_ACTION_CAST(&bt_SPC51_OPERRATIONAL_i)
};
//${SMs::bt_SPC51::SM::OPERRATIONAL}
QState bt_SPC51_OPERRATIONAL_e(bt_SPC51 * const me) {
    // revert the read back to default
    bsl_read = 0x00U;

    //remove energy restriction on IO stream recieve
    sl_iostream_uart_set_rx_energy_mode_restriction(sl_iostream_uart_vcom_handle, false);
    sl_led_turn_off(&sl_led_led0);

    Q_UNUSED_PAR(me);
    return QM_ENTRY(&bt_SPC51_OPERRATIONAL_s);
}
//${SMs::bt_SPC51::SM::OPERRATIONAL::initial}
QState bt_SPC51_OPERRATIONAL_i(bt_SPC51 * const me) {
    //${SMs::bt_SPC51::SM::OPERRATIONAL::initial}
    static struct {
        QMState const *target;
        QActionHandler act[2];
    } const tatbl_ = { // tran-action table
        &bt_SPC51_ADVERTISING_s, // target state
        {
            Q_ACTION_CAST(&bt_SPC51_ADVERTISING_e), // entry
            Q_ACTION_NULL // zero terminator
        }
    };
    return QM_TRAN_INIT(&tatbl_);
}
//${SMs::bt_SPC51::SM::OPERRATIONAL}
QState bt_SPC51_OPERRATIONAL(bt_SPC51 * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        //${SMs::bt_SPC51::SM::OPERRATIONAL::sl_bt_evt_gatt_server_attribute_~}
        case sl_bt_evt_gatt_server_attribute_value_id: {
            send_notification();
            status_ = QM_HANDLED();
            break;
        }
        //${SMs::bt_SPC51::SM::OPERRATIONAL::sl_bt_evt_connection_parameters_~}
        case sl_bt_evt_connection_parameters_id: {
            switch (event->data.evt_connection_parameters.security_mode)
                {
                case sl_bt_connection_mode1_level1:
                  app_log_info("No Security\n");
                  break;
                case sl_bt_connection_mode1_level2:
                  app_log_info("Unauthenticated pairing with encryption (Just Works)\n");
                  break;
                case sl_bt_connection_mode1_level3:
                  app_log_info("Authenticated pairing with encryption (Legacy Pairing)\n");
                  break;
                case sl_bt_connection_mode1_level4:
                  app_log_info("Authenticated Secure Connections pairing with encryption (BT 4.2 LE Secure Pairing)\n");
                  break;
                default:
                  break;
                }
            status_ = QM_HANDLED();
            break;
        }
        //${SMs::bt_SPC51::SM::OPERRATIONAL::sl_bt_evt_connection_closed_id}
        case sl_bt_evt_connection_closed_id: {
            app_log_info("Connection Closed....\n");

            status_ = QM_HANDLED();
            break;
        }
        //${SMs::bt_SPC51::SM::OPERRATIONAL::NEXT_FIRMWARE_UPDATE_STATE_ID}
        case NEXT_FIRMWARE_UPDATE_STATE_ID: {
            size_t gabage_length;
            while (sl_iostream_read(SL_IOSTREAM_STDIN,
                    BSL_RX_buffer, (size_t)(MAX_PACKET_SIZE + 2U),
                    &gabage_length) == SL_STATUS_OK) {
             //Just read and discard data until buffer is empty
            }

