Kamurasi-Jordan-Arthur/1621_Light_RF/bt_spc5x-redesign/Scr/bt_SPC51_SM.c
            g_ota_data.CorrectPassword=true;
            //${SMs::bt_SPC51::SM::OPERRATIONAL::NEXT_FIRMWARE_UP~::[g_ota_data.Ucomplete]}
            if (g_ota_data.Ucomplete) {
                static struct {
                    QMState const *target;
                    QActionHandler act[2];
                } const tatbl_ = { // tran-action table
                    &bt_SPC51_FIRMWARE_UPDATE_s, // target state
                    {
                        Q_ACTION_CAST(&bt_SPC51_FIRMWARE_UPDATE_i), // initial tran.
                        Q_ACTION_NULL // zero terminator
                    }
                };
                status_ = QM_TRAN(&tatbl_);
            }
            //${SMs::bt_SPC51::SM::OPERRATIONAL::NEXT_FIRMWARE_UP~::[INCOPLETE_UPDATE]}
            else {
                static struct {
                    QMState const *target;
                    QActionHandler act[2];
                } const tatbl_ = { // tran-action table
                    &bt_SPC51_UNLOCK_s, // target state
                    {
                        Q_ACTION_CAST(&bt_SPC51_UNLOCK_e), // entry
                        Q_ACTION_NULL // zero terminator
                    }
                };
                status_ = QM_TRAN(&tatbl_);
            }
            break;
        }
        //${SMs::bt_SPC51::SM::OPERRATIONAL::sl_bt_evt_gatt_server_user_write~}
        case sl_bt_evt_gatt_server_user_write_request_id: {
            //${SMs::bt_SPC51::SM::OPERRATIONAL::sl_bt_evt_gatt_s~::[UPDATE_CMD!!!]}
            if (event->data.evt_gatt_server_user_write_request.value.data[0] ==  100U) {
                me->update_connection = event->data.evt_gatt_server_user_write_request.connection;

                //optimum connection parameter for firmware update
                me->sc =  sl_bt_connection_set_parameters(me->update_connection ,
                                                          30U,
                                                          165U,
                                                          0U,
                                                          200U,
                                                          CONN_MIN_CE_LENGTH,
                                                          CONN_MAX_CE_LENGTH);
                app_assert_status(me->sc);


                g_ota_data.total_firmware_size = *(uint32_t *) (&(event->data.evt_gatt_server_user_write_request.value.data[3]));
                g_ota_data.chunk_size = *(uint16_t *) (&(event->data.evt_gatt_server_user_write_request.value.data[1]));
                 // fill in the password
                memcpy(me->bsl_pwd, (uint8_t *) &(event->data.evt_gatt_server_user_write_request.value.data[7]), 32);

                app_log_info(" The total firmware size is %lu and chunk size %u: ",g_ota_data.total_firmware_size, g_ota_data.chunk_size);

                // Stop the advertising.
                me->sc = sl_bt_advertiser_stop(me->advertising_set_handle);
                app_assert_status(me->sc);

                //Set energy restriction on IO stream
                sl_iostream_uart_set_rx_energy_mode_restriction(sl_iostream_uart_vcom_handle, true);

                //Request for a software invocation from SPC5x.
                BSL_software_trigger();

                // Have to disable buttons operations from now onwards
                //app_button_press_disable();
                app_log_info("Buttons disabled.\n");

                me->sc = sl_sleeptimer_restart_timer_ms(
                    &updateTimer,
                    BSL_INVOCK_DELAY,
                    updateTimerEx_Callback,
                    NULL,
                    0,      // priority
                    0       // option_flags
                );
                app_assert_status(me->sc);

                app_log_info("UpdateTimer Started\n");


                app_log_info("Update char : %u\n", event->data.evt_gatt_server_user_write_request.characteristic);



                status_ = QM_HANDLED();
            }
            //${SMs::bt_SPC51::SM::OPERRATIONAL::sl_bt_evt_gatt_s~::[else]}
            else {
                app_log_warning("Wrong Command TYPE 100 \n");


                me->sc = sl_bt_gatt_server_send_user_write_response(event->data.evt_gatt_server_user_write_request.connection,
                                                           event->data.evt_gatt_server_user_write_request.characteristic,
                                                           0U);
                app_assert_status(me->sc);
                status_ = QM_HANDLED();
            }
            break;
        }
        //${SMs::bt_SPC51::SM::OPERRATIONAL::sl_bt_evt_sm_confirm_bonding_id}
        case sl_bt_evt_sm_confirm_bonding_id: {
            me->sc = sl_bt_sm_bonding_confirm(event->data.evt_sm_confirm_bonding.connection, 1U);
            app_assert_status(me->sc);

            app_log_info("Remote bonding reqeust confirmed.\n");
            status_ = QM_HANDLED();
            break;
        }
        //${SMs::bt_SPC51::SM::OPERRATIONAL::sl_bt_evt_sm_passkey_display_id}
        case sl_bt_evt_sm_passkey_display_id: {
            app_log_info("PK: %06lu\n", event->data.evt_sm_passkey_display.passkey);
            //sl_iostream_write(sl_iostream_vcom_handle, &(event->data.evt_sm_passkey_display.passkey), (size_t)6U);
            printf("PK: %06lu\n", event->data.evt_sm_passkey_display.passkey);
            status_ = QM_HANDLED();
            break;
        }
        default: {
            status_ = QM_SUPER();
            break;
        }
    }
    Q_UNUSED_PAR(me);
    return status_;
}

//${SMs::bt_SPC51::SM::OPERRATIONAL::ADVERTISING} ............................
QMState const bt_SPC51_ADVERTISING_s = {
    &bt_SPC51_OPERRATIONAL_s, // superstate
    Q_STATE_CAST(&bt_SPC51_ADVERTISING),
    Q_ACTION_CAST(&bt_SPC51_ADVERTISING_e),
    Q_ACTION_NULL, // no exit action
    Q_ACTION_NULL  // no initial tran.
};
//${SMs::bt_SPC51::SM::OPERRATIONAL::ADVERTISING}
QState bt_SPC51_ADVERTISING_e(bt_SPC51 * const me) {
    //after that restrict new connections
    //me->sc = sl_bt_sm_configure((INITIAL_FLAG_CONFIG || (1U << 4)), sl_bt_sm_io_capability_displayonly);
    //app_assert_status(me->sc);

    me->sc = sl_bt_legacy_advertiser_start(me->advertising_set_handle,
                                     sl_bt_legacy_advertiser_connectable);
    app_assert_status(me->sc);


    app_log_info("Advertising....\n");

