Kamurasi-Jordan-Arthur/1621_Light_RF/bt_spc5x-redesign/Scr/bt_SPC51_SM.c
    sl_simple_button_enable(&sl_button_btn0);

    app_button_press_enable();

    return QM_ENTRY(&bt_SPC51_ADVERTISING_s);
}
//${SMs::bt_SPC51::SM::OPERRATIONAL::ADVERTISING}
QState bt_SPC51_ADVERTISING(bt_SPC51 * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        //${SMs::bt_SPC51::SM::OPERRATIONAL::ADVERTISING::sl_bt_evt_connection_opened_id}
        case sl_bt_evt_connection_opened_id: {
            app_log_info("Connection Opened....\n");

            me->sc = sl_sleeptimer_stop_timer(&newConnectionTimer);

            if(me->sc == SL_STATUS_OK){
                app_log_info("New device connection timer halted...\n");
                sl_led_turn_off(&sl_led_led0);
                blink_count = 0U;
            }


            //me->sc = sl_bt_sm_increase_security(event->data.evt_connection_opened.connection);
            //app_assert_status(me->sc);


            //${SMs::bt_SPC51::SM::OPERRATIONAL::ADVERTISING::sl_bt_evt_connec~::[Newdevice]}
            if (SL_BT_INVALID_BONDING_HANDLE == event->data.evt_connection_opened.bonding) {
                app_log_info("New Device.\n");

                static struct {
                    QMState const *target;
                    QActionHandler act[2];
                } const tatbl_ = { // tran-action table
                    &bt_SPC51_MANAGING_CONNECTION_s, // target state
                    {
                        Q_ACTION_CAST(&bt_SPC51_MANAGING_CONNECTION_e), // entry
                        Q_ACTION_NULL // zero terminator
                    }
                };
                status_ = QM_TRAN(&tatbl_);
            }
            //${SMs::bt_SPC51::SM::OPERRATIONAL::ADVERTISING::sl_bt_evt_connec~::[else]}
            else {
                app_log_info("Already Bonded.\n");

                me->sc = sl_bt_sm_increase_security(event->data.evt_connection_opened.connection);
                app_assert_status(me->sc);

                //Request for optimum communication parameter value
                me->sc =  sl_bt_connection_set_parameters(event->data.evt_connection_opened.connection,
                                                          CONN_INTERVAL_MIN,
                                                          CONN_INTERVAL_MAX,
                                                          CONN_RESPONDER_LATENCY,
                                                          CONN_TIMEOUT,
                                                          CONN_MIN_CE_LENGTH,
                                                          CONN_MAX_CE_LENGTH);
                app_assert_status(me->sc);

                //me->sc = sl_bt_legacy_advertiser_start(me->advertising_set_handle,
                //                                 sl_bt_legacy_advertiser_connectable);
                //app_assert_status(me->sc);

                //app_log_info("advertising....\n");
                static struct {
                    QMState const *target;
                    QActionHandler act[2];
                } const tatbl_ = { // tran-action table
                    &bt_SPC51_ADVERTISING_s, // target state
                    {
                        Q_ACTION_CAST(&bt_SPC51_ADVERTISING_e), // entry
                        Q_ACTION_NULL // zero terminator
                    }
                };
                status_ = QM_TRAN(&tatbl_);
            }
            break;
        }
        //${SMs::bt_SPC51::SM::OPERRATIONAL::ADVERTISING::sl_bt_evt_gatt_server_characteri~}
        case sl_bt_evt_gatt_server_characteristic_status_id: {
            if (event->data.evt_gatt_server_characteristic_status.status_flags == sl_bt_gatt_server_client_config) {
              if (event->data.evt_gatt_server_characteristic_status.client_config_flags == sl_bt_gatt_server_notification) {
                  // Notifications have been enabled by the client

                   notify_flag_change();


              }
            }
            status_ = QM_HANDLED();
            break;
        }
        //${SMs::bt_SPC51::SM::OPERRATIONAL::ADVERTISING::BUTTON_ID}
        case BUTTON_ID: {
            switch (Q_EVT_CAST(buttonEvt_t)->duration) {
                  case APP_BUTTON_PRESS_DURATION_SHORT:

                    if(SL_SIMPLE_BUTTON_INSTANCE(Q_EVT_CAST(buttonEvt_t)->keyId) == &sl_button_btn0){

                        //me->sc = sl_bt_sm_configure((INITIAL_FLAG_CONFIG & ~(1U << 4)), sl_bt_sm_io_capability_displayonly);
                        //app_assert_status(me->sc);


                        //de
                        sl_simple_button_disable(&sl_button_btn0);

                        me->sc = sl_sleeptimer_restart_periodic_timer_ms(
                            &newConnectionTimer,
                            NEW_DEVICE_CONNECTABLE_DECAY,
                            newConnectionTimerCallback,
                            NULL,
                            0,      // priority
                            0       // option_flags
                        );
                        app_assert_status(me->sc);

                        app_log_info("Blinking...\n");

                    }

                    break;


                  case APP_BUTTON_PRESS_DURATION_LONG:
                    if(SL_SIMPLE_BUTTON_INSTANCE(Q_EVT_CAST(buttonEvt_t)->keyId) == &sl_button_btn0){

                        me->sc = sl_bt_sm_delete_bondings();
                        app_assert_status(me->sc);

                        app_log_info("All-bonds deleted...\n");

                    }
                    break;


                  case APP_BUTTON_PRESS_DURATION_VERYLONG:
                    if(SL_SIMPLE_BUTTON_INSTANCE(Q_EVT_CAST(buttonEvt_t)->keyId) == &sl_button_btn0){
                        app_log_info("System reset\n");

                        sl_bt_system_reset(sl_bt_system_boot_mode_normal);
                    }
                  break;

                  default:
                    break;
            }
            status_ = QM_HANDLED();
            break;
        }
        default: {
            status_ = QM_SUPER();
            break;
        }
    }
    return status_;
}

//${SMs::bt_SPC51::SM::OPERRATIONAL::MANAGING_CONNECTION} ....................
QMState const bt_SPC51_MANAGING_CONNECTION_s = {
    &bt_SPC51_OPERRATIONAL_s, // superstate
    Q_STATE_CAST(&bt_SPC51_MANAGING_CONNECTION),
    Q_ACTION_CAST(&bt_SPC51_MANAGING_CONNECTION_e),
    Q_ACTION_NULL, // no exit action
    Q_ACTION_NULL  // no initial tran.
};
//${SMs::bt_SPC51::SM::OPERRATIONAL::MANAGING_CONNECTION}
QState bt_SPC51_MANAGING_CONNECTION_e(bt_SPC51 * const me) {
    app_log_info("Managing New connection....\n");

    app_button_press_disable();

    me->sc = sl_bt_sm_increase_security(event->data.evt_connection_opened.connection);
    app_assert_status(me->sc);


    return QM_ENTRY(&bt_SPC51_MANAGING_CONNECTION_s);
}
//${SMs::bt_SPC51::SM::OPERRATIONAL::MANAGING_CONNECTION}
QState bt_SPC51_MANAGING_CONNECTION(bt_SPC51 * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        //${SMs::bt_SPC51::SM::OPERRATIONAL::MANAGING_CONNECT~::sl_bt_evt_sm_bonding_failed_id}
        case sl_bt_evt_sm_bonding_failed_id: {
            //failed bonding close the connection.
            me->sc = sl_bt_connection_close(
                          event->data.evt_sm_bonding_failed.connection);
            app_assert_status(me->sc);

