Kamurasi-Jordan-Arthur/1621_Light_RF/bt_spc5x-redesign/Scr/bt_SPC51_SM.c
            app_log_info("Bonding Failed....\n");
            app_log_info("Closing connection....\n");
            static struct {
                QMState const *target;
                QActionHandler act[2];
            } const tatbl_ = { // tran-action table
                &bt_SPC51_ADVERTISING_s, // target state
                {
                    Q_ACTION_CAST(&bt_SPC51_ADVERTISING_e), // entry
                    Q_ACTION_NULL // zero terminator
                }
            };
            status_ = QM_TRAN(&tatbl_);
            break;
        }
        //${SMs::bt_SPC51::SM::OPERRATIONAL::MANAGING_CONNECT~::sl_bt_evt_sm_bonded_id}
        case sl_bt_evt_sm_bonded_id: {
            app_log_info("Bonded....\n");

            //Request for optimum communication parameter value
            me->sc =  sl_bt_connection_set_parameters(event->data.evt_connection_opened.connection,
                                                      CONN_INTERVAL_MIN,
                                                      CONN_INTERVAL_MAX,
                                                      CONN_RESPONDER_LATENCY,
                                                      CONN_TIMEOUT,
                                                      CONN_MIN_CE_LENGTH,
                                                      CONN_MAX_CE_LENGTH);
            app_assert_status(me->sc);

            static struct {
                QMState const *target;
                QActionHandler act[2];
            } const tatbl_ = { // tran-action table
                &bt_SPC51_ADVERTISING_s, // target state
                {
                    Q_ACTION_CAST(&bt_SPC51_ADVERTISING_e), // entry
                    Q_ACTION_NULL // zero terminator
                }
            };
            status_ = QM_TRAN(&tatbl_);
            break;
        }
        default: {
            status_ = QM_SUPER();
            break;
        }
    }
    return status_;
}

//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE} ......................................
QMState const bt_SPC51_FIRMWARE_UPDATE_s = {
    QM_STATE_NULL, // superstate (top)
    Q_STATE_CAST(&bt_SPC51_FIRMWARE_UPDATE),
    Q_ACTION_NULL, // no entry action
    Q_ACTION_CAST(&bt_SPC51_FIRMWARE_UPDATE_x),
    Q_ACTION_CAST(&bt_SPC51_FIRMWARE_UPDATE_i)
};
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE}
QState bt_SPC51_FIRMWARE_UPDATE_x(bt_SPC51 * const me) {
    bsl_read = OTHER;

    (void)me; // unused parameter
    return QM_EXIT(&bt_SPC51_FIRMWARE_UPDATE_s);
}
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::initial}
QState bt_SPC51_FIRMWARE_UPDATE_i(bt_SPC51 * const me) {
    //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::initial}
    static struct {
        QMState const *target;
        QActionHandler act[2];
    } const tatbl_ = { // tran-action table
        &bt_SPC51_SEND_CONN_s, // target state
        {
            Q_ACTION_CAST(&bt_SPC51_SEND_CONN_e), // entry
            Q_ACTION_NULL // zero terminator
        }
    };
    return QM_TRAN_INIT(&tatbl_);
}
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE}
QState bt_SPC51_FIRMWARE_UPDATE(bt_SPC51 * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::sl_bt_evt_connection_closed_id}
        case sl_bt_evt_connection_closed_id: {
            //TUrn the led off
            sl_led_turn_off(&sl_led_led0);
            //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::sl_bt_evt_connec~::[updateConnectioLost]}
            if (me->update_connection == event->data.evt_connection_closed.connection &&
                g_ota_data.bytes_sent != g_ota_data.total_firmware_size &&
                g_ota_data.CorrectPassword)
            {
                g_ota_data.Ucomplete = false;
                bsl_read = OTHER;
                read_point = 0U;

                static struct {
                    QMState const *target;
                    QActionHandler act[4];
                } const tatbl_ = { // tran-action table
                    &bt_SPC51_OPERRATIONAL_s, // target state
                    {
                        Q_ACTION_CAST(&bt_SPC51_FIRMWARE_UPDATE_x), // exit
                        Q_ACTION_CAST(&bt_SPC51_OPERRATIONAL_e), // entry
                        Q_ACTION_CAST(&bt_SPC51_OPERRATIONAL_i), // initial tran.
                        Q_ACTION_NULL // zero terminator
                    }
                };
                status_ = QM_TRAN(&tatbl_);
            }
            else {
                status_ = QM_UNHANDLED();
            }
            break;
        }
        //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::BUTTON_ID}
        case BUTTON_ID: {


            /* g_ota_data.Ucomplete = false;
            bsl_read = OTHER;
            read_point = 0U;

            me->sc = sl_bt_gatt_server_send_user_write_response(me->update_connection,
                                                                       gattdb_firmware_update_cmd,
                                                                       0U);
            app_assert_status(me->sc); */

            status_ = QM_HANDLED();
            break;
        }
        default: {
            status_ = QM_SUPER();
            break;
        }
    }
    return status_;
}

//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::SEND_CONN} ...........................
QMState const bt_SPC51_SEND_CONN_s = {
    &bt_SPC51_FIRMWARE_UPDATE_s, // superstate
    Q_STATE_CAST(&bt_SPC51_SEND_CONN),
    Q_ACTION_CAST(&bt_SPC51_SEND_CONN_e),
    Q_ACTION_CAST(&bt_SPC51_SEND_CONN_x),
    Q_ACTION_NULL  // no initial tran.
};
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::SEND_CONN}
QState bt_SPC51_SEND_CONN_e(bt_SPC51 * const me) {
    Host_BSL_Connection();
    LED_DEB

    me->sc = sl_sleeptimer_restart_timer_ms(
      &updateTimer,
      CONN_RSP_WINDOW,
      updateTimerEx_Callback,
      NULL,
      0,      // priority
      0       // option_flags
    );

    app_assert_status(me->sc);

    //DROP A FLAG
    BSL_RX_buffer[0] = 1U;

    return QM_ENTRY(&bt_SPC51_SEND_CONN_s);
}
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::SEND_CONN}
QState bt_SPC51_SEND_CONN_x(bt_SPC51 * const me) {
    //LED_DEB
    (void)me; // unused parameter
    return QM_EXIT(&bt_SPC51_SEND_CONN_s);
}
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::SEND_CONN}
QState bt_SPC51_SEND_CONN(bt_SPC51 * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::SEND_CONN::UART_ARK_ID}
        case UART_ARK_ID: {
            app_assert_s(BSL_RX_buffer[0] == uart_noError);
            //bsl_read = OTHER;

            me->sc = sl_sleeptimer_restart_timer_ms(
              &updateTimer,
              BSL_CHECK_STATUS_WAIT,
              updateTimerEx_Callback,
              NULL,
              0,      // priority
              0       // option_flags
            );
            app_assert_status(me->sc);
            status_ = QM_HANDLED();
            break;
        }
        //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::SEND_CONN::NEXT_FIRMWARE_UPDATE_STATE_ID}
        case NEXT_FIRMWARE_UPDATE_STATE_ID: {
            //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::SEND_CONN::NEXT_FIRMWARE_UP~::[FLAGSTILLPRESENT!!!]}
            if (BSL_RX_buffer[0] == 1U) {
                LED_DEB

