Kamurasi-Jordan-Arthur/1621_Light_RF/bt_spc5x-redesign/Scr/bt_SPC51_SM.c
                //Device is in wrong state to update

                me->sc = sl_bt_gatt_server_send_user_write_response(me->update_connection,
                                                               gattdb_firmware_update_cmd,
                                                               0x0181U);
                static struct {
                    QMState const *target;
                    QActionHandler act[5];
                } const tatbl_ = { // tran-action table
                    &bt_SPC51_OPERRATIONAL_s, // target state
                    {
                        Q_ACTION_CAST(&bt_SPC51_SEND_CONN_x), // exit
                        Q_ACTION_CAST(&bt_SPC51_FIRMWARE_UPDATE_x), // exit
                        Q_ACTION_CAST(&bt_SPC51_OPERRATIONAL_e), // entry
                        Q_ACTION_CAST(&bt_SPC51_OPERRATIONAL_i), // initial tran.
                        Q_ACTION_NULL // zero terminator
                    }
                };
                status_ = QM_TRAN(&tatbl_);
            }
            //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::SEND_CONN::NEXT_FIRMWARE_UP~::[else]}
            else {
                static struct {
                    QMState const *target;
                    QActionHandler act[3];
                } const tatbl_ = { // tran-action table
                    &bt_SPC51_CheckStaus_s, // target state
                    {
                        Q_ACTION_CAST(&bt_SPC51_SEND_CONN_x), // exit
                        Q_ACTION_CAST(&bt_SPC51_CheckStaus_e), // entry
                        Q_ACTION_NULL // zero terminator
                    }
                };
                status_ = QM_TRAN(&tatbl_);
            }
            break;
        }
        default: {
            status_ = QM_SUPER();
            break;
        }
    }
    return status_;
}

//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::GET_DEV_INFO} ........................
QMState const bt_SPC51_GET_DEV_INFO_s = {
    &bt_SPC51_FIRMWARE_UPDATE_s, // superstate
    Q_STATE_CAST(&bt_SPC51_GET_DEV_INFO),
    Q_ACTION_CAST(&bt_SPC51_GET_DEV_INFO_e),
    Q_ACTION_CAST(&bt_SPC51_GET_DEV_INFO_x),
    Q_ACTION_NULL  // no initial tran.
};
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::GET_DEV_INFO}
QState bt_SPC51_GET_DEV_INFO_e(bt_SPC51 * const me) {
    Host_BSL_GetID();
    LED_DEB
    Q_UNUSED_PAR(me);
    return QM_ENTRY(&bt_SPC51_GET_DEV_INFO_s);
}
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::GET_DEV_INFO}
QState bt_SPC51_GET_DEV_INFO_x(bt_SPC51 * const me) {
    //LED_DEB
    (void)me; // unused parameter
    return QM_EXIT(&bt_SPC51_GET_DEV_INFO_s);
}
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::GET_DEV_INFO}
QState bt_SPC51_GET_DEV_INFO(bt_SPC51 * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::GET_DEV_INFO::UART_ARK_ID}
        case UART_ARK_ID: {
            app_assert_s(BSL_RX_buffer[0] == uart_noError);

            bsl_read = GetID_RSP;

            status_ = QM_HANDLED();
            break;
        }
        //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::GET_DEV_INFO::NEXT_FIRMWARE_UPDATE_STATE_ID}
        case NEXT_FIRMWARE_UPDATE_STATE_ID: {
            BSL_MAX_BUFFER_SIZE =
                *(uint16_t *) &BSL_RX_buffer[HDR_LEN_CMD_BYTES + ID_BACK - 14];


            // Only way of asserting if its correct

            //  the choosen max buffersize should accomadate the max packet size
            app_assert_s(BSL_MAX_BUFFER_SIZE >= MAX_PACKET_SIZE);

            //bsl_read = OTHER;
            static struct {
                QMState const *target;
                QActionHandler act[3];
            } const tatbl_ = { // tran-action table
                &bt_SPC51_UNLOCK_s, // target state
                {
                    Q_ACTION_CAST(&bt_SPC51_GET_DEV_INFO_x), // exit
                    Q_ACTION_CAST(&bt_SPC51_UNLOCK_e), // entry
                    Q_ACTION_NULL // zero terminator
                }
            };
            status_ = QM_TRAN(&tatbl_);
            break;
        }
        default: {
            status_ = QM_SUPER();
            break;
        }
    }
    return status_;
}

//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCK} ..............................
QMState const bt_SPC51_UNLOCK_s = {
    &bt_SPC51_FIRMWARE_UPDATE_s, // superstate
    Q_STATE_CAST(&bt_SPC51_UNLOCK),
    Q_ACTION_CAST(&bt_SPC51_UNLOCK_e),
    Q_ACTION_CAST(&bt_SPC51_UNLOCK_x),
    Q_ACTION_NULL  // no initial tran.
};
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCK}
QState bt_SPC51_UNLOCK_e(bt_SPC51 * const me) {
    Host_BSL_loadPassword((uint8_t *)(me->bsl_pwd));

    LED_DEB

    g_ota_data.CorrectPassword = true;
    return QM_ENTRY(&bt_SPC51_UNLOCK_s);
}
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCK}
QState bt_SPC51_UNLOCK_x(bt_SPC51 * const me) {
    //LED_DEB
    (void)me; // unused parameter
    return QM_EXIT(&bt_SPC51_UNLOCK_s);
}
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCK}
QState bt_SPC51_UNLOCK(bt_SPC51 * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCK::UART_ARK_ID}
        case UART_ARK_ID: {
            app_assert_s(BSL_RX_buffer[0] == uart_noError);

            bsl_read = UNLOCK_RSP;
            status_ = QM_HANDLED();
            break;
        }
        //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCK::NEXT_FIRMWARE_UPDATE_STATE_ID}
        case NEXT_FIRMWARE_UPDATE_STATE_ID: {
            //bsl_read = OTHER;
            //app_assert_s(BSL_RX_buffer[HDR_LEN_CMD_BYTES + ACK_BYTE - 1] == eBSL_success);
            //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCK::NEXT_FIRMWARE_UP~::[succesfull!!]}
            if (BSL_RX_buffer[HDR_LEN_CMD_BYTES + ACK_BYTE - 1] == eBSL_success) {
                g_ota_data.CorrectPassword = true;
                static struct {
                    QMState const *target;
                    QActionHandler act[3];
                } const tatbl_ = { // tran-action table
                    &bt_SPC51_UNLOCKED_s, // target state
                    {
                        Q_ACTION_CAST(&bt_SPC51_UNLOCK_x), // exit
                        Q_ACTION_CAST(&bt_SPC51_UNLOCKED_i), // initial tran.
                        Q_ACTION_NULL // zero terminator
                    }
                };
                status_ = QM_TRAN(&tatbl_);
            }
            //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCK::NEXT_FIRMWARE_UP~::[Wrong_Password]}
            else if (g_ota_data.CorrectPassword) {
                //password wrong
                g_ota_data.CorrectPassword = false;

                me->sc = sl_bt_gatt_server_send_user_write_response(me->update_connection,
                                                                   gattdb_firmware_update_cmd,
                                                                   0U);
                app_assert_status(me->sc);


                //close connection.
                me->sc = sl_bt_connection_close(
                              me->update_connection);

