Kamurasi-Jordan-Arthur/1621_Light_RF/bt_spc5x-redesign/Scr/bt_SPC51_SM.c
                app_assert_status(me->sc);

                me->sc = sl_sleeptimer_restart_timer_ms(
                            &updateTimer,
                            (2010U),
                            updateTimerEx_Callback,
                            NULL,
                            0,      // priority
                            0       // option_flags
                        );
                app_assert_status(me->sc);
                status_ = QM_HANDLED();
            }
            //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCK::NEXT_FIRMWARE_UP~::[else]}
            else {
                static struct {
                    QMState const *target;
                    QActionHandler act[3];
                } const tatbl_ = { // tran-action table
                    &bt_SPC51_START_APP_s, // target state
                    {
                        Q_ACTION_CAST(&bt_SPC51_UNLOCK_x), // exit
                        Q_ACTION_CAST(&bt_SPC51_START_APP_e), // entry
                        Q_ACTION_NULL // zero terminator
                    }
                };
                status_ = QM_TRAN(&tatbl_);
            }
            break;
        }
        default: {
            status_ = QM_SUPER();
            break;
        }
    }
    return status_;
}

//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED} ............................
QMState const bt_SPC51_UNLOCKED_s = {
    &bt_SPC51_FIRMWARE_UPDATE_s, // superstate
    Q_STATE_CAST(&bt_SPC51_UNLOCKED),
    Q_ACTION_NULL, // no entry action
    Q_ACTION_NULL, // no exit action
    Q_ACTION_CAST(&bt_SPC51_UNLOCKED_i)
};
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::initial}
QState bt_SPC51_UNLOCKED_i(bt_SPC51 * const me) {
    //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::initial}
    static struct {
        QMState const *target;
        QActionHandler act[2];
    } const tatbl_ = { // tran-action table
        &bt_SPC51_MASS_ERASE_s, // target state
        {
            Q_ACTION_CAST(&bt_SPC51_MASS_ERASE_e), // entry
            Q_ACTION_NULL // zero terminator
        }
    };
    return QM_TRAN_INIT(&tatbl_);
}
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED}
QState bt_SPC51_UNLOCKED(bt_SPC51 * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        default: {
            status_ = QM_SUPER();
            break;
        }
    }
    Q_UNUSED_PAR(me);
    return status_;
}

//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::MASS_ERASE} ................
QMState const bt_SPC51_MASS_ERASE_s = {
    &bt_SPC51_UNLOCKED_s, // superstate
    Q_STATE_CAST(&bt_SPC51_MASS_ERASE),
    Q_ACTION_CAST(&bt_SPC51_MASS_ERASE_e),
    Q_ACTION_CAST(&bt_SPC51_MASS_ERASE_x),
    Q_ACTION_NULL  // no initial tran.
};
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::MASS_ERASE}
QState bt_SPC51_MASS_ERASE_e(bt_SPC51 * const me) {
    Host_BSL_MassErase();
    LED_DEB
    Q_UNUSED_PAR(me);
    return QM_ENTRY(&bt_SPC51_MASS_ERASE_s);
}
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::MASS_ERASE}
QState bt_SPC51_MASS_ERASE_x(bt_SPC51 * const me) {
    //LED_DEB
    (void)me; // unused parameter
    return QM_EXIT(&bt_SPC51_MASS_ERASE_s);
}
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::MASS_ERASE}
QState bt_SPC51_MASS_ERASE(bt_SPC51 * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::MASS_ERASE::UART_ARK_ID}
        case UART_ARK_ID: {
            app_assert_s(BSL_RX_buffer[0] == uart_noError);

            bsl_read = MASS_ERASE_RSP;


            status_ = QM_HANDLED();
            break;
        }
        //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::MASS_ERASE::NEXT_FIRMWARE_UPDATE_STATE_ID}
        case NEXT_FIRMWARE_UPDATE_STATE_ID: {
            app_assert_s(BSL_RX_buffer[HDR_LEN_CMD_BYTES + ACK_BYTE - 1] == eBSL_success);

            //initialse the section variable
            //me->section = 0x00U;

            static struct {
                QMState const *target;
                QActionHandler act[3];
            } const tatbl_ = { // tran-action table
                &bt_SPC51_PROGRAM_SECTION_s, // target state
                {
                    Q_ACTION_CAST(&bt_SPC51_MASS_ERASE_x), // exit
                    Q_ACTION_CAST(&bt_SPC51_PROGRAM_SECTION_e), // entry
                    Q_ACTION_NULL // zero terminator
                }
            };
            status_ = QM_TRAN(&tatbl_);
            break;
        }
        default: {
            status_ = QM_SUPER();
            break;
        }
    }
    return status_;
}

//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::PROGRAM_SECTION} ...........
QMState const bt_SPC51_PROGRAM_SECTION_s = {
    &bt_SPC51_UNLOCKED_s, // superstate
    Q_STATE_CAST(&bt_SPC51_PROGRAM_SECTION),
    Q_ACTION_CAST(&bt_SPC51_PROGRAM_SECTION_e),
    Q_ACTION_CAST(&bt_SPC51_PROGRAM_SECTION_x),
    Q_ACTION_NULL  // no initial tran.
};
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::PROGRAM_SECTION}
QState bt_SPC51_PROGRAM_SECTION_e(bt_SPC51 * const me) {
    app_log_info("PROGRAM SECTION  \n");
    // Actions on entering the state, regardless of trigger (button or BLE)

    me->TargetAddress = BSL_START_ADDRESS;
    g_ota_data.bytes_sent = 0U;
    me->ui16BytesToWrite = 0U;
    // The total firmware size must be set here



    me->sc = sl_bt_gatt_server_send_user_write_response(me->update_connection,
                                                       gattdb_firmware_update_cmd,
                                                       0U);
    app_assert_status(me->sc);
    return QM_ENTRY(&bt_SPC51_PROGRAM_SECTION_s);
}
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::PROGRAM_SECTION}
QState bt_SPC51_PROGRAM_SECTION_x(bt_SPC51 * const me) {
    //LED_DEB
    (void)me; // unused parameter
    return QM_EXIT(&bt_SPC51_PROGRAM_SECTION_s);
}
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::PROGRAM_SECTION}
QState bt_SPC51_PROGRAM_SECTION(bt_SPC51 * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::PROGRAM_SECTION::UART_ARK_ID}
        case UART_ARK_ID: {
            // This is the low-level check for a successful acknowledgment
            app_assert_s(BSL_RX_buffer[0] == uart_noError);
            bsl_read = DATA_WRITE_RSP;





            status_ = QM_HANDLED();
            break;
        }
        //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::PROGRAM_SECTION::sl_bt_evt_gatt_server_user_write~}
        case sl_bt_evt_gatt_server_user_write_request_id: {
            //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::PROGRAM_SECTION::sl_bt_evt_gatt_s~::[update_connection]}
            if (me->update_connection == event->data.evt_gatt_server_user_write_request.connection) {


                app_log_info(" _user_write_reques\n");


                //where we capture the data
                uint8_t app_firmware_data_len = event->data.evt_gatt_server_user_write_request.value.len;


                //copy the data into buffer
                memcpy(&app_firmware_data_buffer[me->ui16BytesToWrite],
                      event->data.evt_gatt_server_user_write_request.value.data,
                       app_firmware_data_len);


