Kamurasi-Jordan-Arthur/1621_Light_RF/bt_spc5x-redesign/Scr/bt_SPC51_SM.c
                // Update the total bytes sent
                g_ota_data.bytes_sent += app_firmware_data_len;
                me->ui16BytesToWrite  += app_firmware_data_len;

                if((((MAX_PAYLOAD_DATA_SIZE * 2U) - me->ui16BytesToWrite) > g_ota_data.chunk_size)
                    && (g_ota_data.bytes_sent < g_ota_data.total_firmware_size) ){

                        me->sc = sl_bt_gatt_server_send_user_write_response(me->update_connection,
                                                                           gattdb_firmware_update_cmd,
                                                                           0U);
                        app_assert_status(me->sc);

                }

                 else{

                        me->data = app_firmware_data_buffer;

                        // Call the BSL function to send the data
                        bt_SPC51_Host_BSL_writeMemory(me);

                }









                status_ = QM_HANDLED();
            }
            //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::PROGRAM_SECTION::sl_bt_evt_gatt_s~::[else]}
            else {
                //close this other connection.
                me->sc = sl_bt_connection_close(
                              event->data.evt_gatt_server_user_write_request.connection);
                status_ = QM_HANDLED();
            }
            break;
        }
        //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::PROGRAM_SECTION::NEXT_FIRMWARE_UPDATE_STATE_ID}
        case NEXT_FIRMWARE_UPDATE_STATE_ID: {
            app_log_info(" NEXT FIRMWARE UPDATE \n");


            app_log_info(" Fraction Sent %lu / %lu  ",g_ota_data.bytes_sent,g_ota_data.total_firmware_size);


            app_assert_s(BSL_RX_buffer[HDR_LEN_CMD_BYTES + ACK_BYTE - 1] == eBSL_success);
            //   printf("\n");

            LED_DEB

            //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::PROGRAM_SECTION::NEXT_FIRMWARE_UP~::[UnwritenBytesToWrite!!]}
            if (me->ui16BytesToWrite) {
                app_log_info("UnwritenBytesToWrite");
                bt_SPC51_Host_BSL_writeMemory(me);

                status_ = QM_HANDLED();
            }
            //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::PROGRAM_SECTION::NEXT_FIRMWARE_UP~::[MORE_DATA!!]}
            else if (g_ota_data.bytes_sent == g_ota_data.total_firmware_size) {
                me->sc = sl_bt_gatt_server_send_user_write_response(me->update_connection,
                                                                   gattdb_firmware_update_cmd,
                                                                   0U);
                app_assert_status(me->sc);
                static struct {
                    QMState const *target;
                    QActionHandler act[3];
                } const tatbl_ = { // tran-action table
                    &bt_SPC51_START_APP_s, // target state
                    {
                        Q_ACTION_CAST(&bt_SPC51_PROGRAM_SECTION_x), // exit
                        Q_ACTION_CAST(&bt_SPC51_START_APP_e), // entry
                        Q_ACTION_NULL // zero terminator
                    }
                };
                status_ = QM_TRAN(&tatbl_);
            }
            //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::PROGRAM_SECTION::NEXT_FIRMWARE_UP~::[else]}
            else {
                app_assert_s(g_ota_data.bytes_sent < g_ota_data.total_firmware_size);

                me->sc = sl_bt_gatt_server_send_user_write_response(me->update_connection,
                                                                   gattdb_firmware_update_cmd,
                                                                   0U);
                app_assert_status(me->sc);

                app_log_info("Waiting for other chunks \n");
                status_ = QM_HANDLED();
            }
            break;
        }
        default: {
            status_ = QM_SUPER();
            break;
        }
    }
    return status_;
}

//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::START_APP} .................
QMState const bt_SPC51_START_APP_s = {
    &bt_SPC51_UNLOCKED_s, // superstate
    Q_STATE_CAST(&bt_SPC51_START_APP),
    Q_ACTION_CAST(&bt_SPC51_START_APP_e),
    Q_ACTION_CAST(&bt_SPC51_START_APP_x),
    Q_ACTION_NULL  // no initial tran.
};
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::START_APP}
QState bt_SPC51_START_APP_e(bt_SPC51 * const me) {
    app_log_info(" Start app \n");


    //Host_BSL_StartApp();
    LED_DEB

    // Action on entering the state: send the BSL command to start the app
    Host_BSL_StartApp();

    Q_UNUSED_PAR(me);
    return QM_ENTRY(&bt_SPC51_START_APP_s);
}
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::START_APP}
QState bt_SPC51_START_APP_x(bt_SPC51 * const me) {
    LED_DEB
    (void)me; // unused parameter
    return QM_EXIT(&bt_SPC51_START_APP_s);
}
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::START_APP}
QState bt_SPC51_START_APP(bt_SPC51 * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::UNLOCKED::START_APP::UART_ARK_ID}
        case UART_ARK_ID: {
            app_assert_s(BSL_RX_buffer[0] == uart_noError);

            app_log_info("Firmware update complete. SPC51 is running the new application.\n");

            if(g_ota_data.CorrectPassword ){
                            //Request for optimum communication parameter value after update from the upade connection
                            me->sc =  sl_bt_connection_set_parameters(me->update_connection,
                                                                      CONN_INTERVAL_MIN,
                                                                      CONN_INTERVAL_MAX,
                                                                      CONN_RESPONDER_LATENCY,
                                                                      CONN_TIMEOUT,
                                                                      CONN_MIN_CE_LENGTH,
                                                                      CONN_MAX_CE_LENGTH);
                            app_assert_status(me->sc);

