Kamurasi-Jordan-Arthur/1621_Light_RF/bt_spc5x-redesign/Scr/bt_SPC51_SM.c
            }

            // Acknowledge the run command
            // Transition back to the OPERRATIONAL state, which will automatically
            // enter the ADVERTISING substate due to its initial transition.

            //TUrn the led off

            g_ota_data.Ucomplete = true;

            static struct {
                QMState const *target;
                QActionHandler act[5];
            } const tatbl_ = { // tran-action table
                &bt_SPC51_OPERRATIONAL_s, // target state
                {
                    Q_ACTION_CAST(&bt_SPC51_START_APP_x), // exit
                    Q_ACTION_CAST(&bt_SPC51_FIRMWARE_UPDATE_x), // exit
                    Q_ACTION_CAST(&bt_SPC51_OPERRATIONAL_e), // entry
                    Q_ACTION_CAST(&bt_SPC51_OPERRATIONAL_i), // initial tran.
                    Q_ACTION_NULL // zero terminator
                }
            };
            status_ = QM_TRAN(&tatbl_);
            break;
        }
        default: {
            status_ = QM_SUPER();
            break;
        }
    }
    return status_;
}

//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::CheckStaus} ..........................
QMState const bt_SPC51_CheckStaus_s = {
    &bt_SPC51_FIRMWARE_UPDATE_s, // superstate
    Q_STATE_CAST(&bt_SPC51_CheckStaus),
    Q_ACTION_CAST(&bt_SPC51_CheckStaus_e),
    Q_ACTION_CAST(&bt_SPC51_CheckStaus_x),
    Q_ACTION_NULL  // no initial tran.
};
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::CheckStaus}
QState bt_SPC51_CheckStaus_e(bt_SPC51 * const me) {
    // Check weather SPC%x is in BSL mode(SPC%x)
    BSL_TX_buffer[0] = (uint8_t) 0xBB;

    // send the data
    me->sc = sl_iostream_write(SL_IOSTREAM_STDIN , BSL_TX_buffer, 1U);
    app_assert_status(me->sc);

    bsl_read = STATUS_CHECK;
    LED_DEB
    return QM_ENTRY(&bt_SPC51_CheckStaus_s);
}
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::CheckStaus}
QState bt_SPC51_CheckStaus_x(bt_SPC51 * const me) {
    //LED_DEB
    (void)me; // unused parameter
    return QM_EXIT(&bt_SPC51_CheckStaus_s);
}
//${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::CheckStaus}
QState bt_SPC51_CheckStaus(bt_SPC51 * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::CheckStaus::UART_ARK_ID}
        case UART_ARK_ID: {
            //bsl_read = OTHER;

            //BSL running state
            app_assert_s(BSL_RX_buffer[0] == 0x51);
            //BSL mode 0x51; application mode 0x22


            me->sc = sl_sleeptimer_restart_timer_ms(
              &updateTimer,
              BSL_CHECK_STATUS_WAIT,
              updateTimerEx_Callback,
              NULL,
              0,      // priority
              0       // option_flags
            );
            app_assert_status(me->sc);
            status_ = QM_HANDLED();
            break;
        }
        //${SMs::bt_SPC51::SM::FIRMWARE_UPDATE::CheckStaus::NEXT_FIRMWARE_UPDATE_STATE_ID}
        case NEXT_FIRMWARE_UPDATE_STATE_ID: {
            static struct {
                QMState const *target;
                QActionHandler act[3];
            } const tatbl_ = { // tran-action table
                &bt_SPC51_GET_DEV_INFO_s, // target state
                {
                    Q_ACTION_CAST(&bt_SPC51_CheckStaus_x), // exit
                    Q_ACTION_CAST(&bt_SPC51_GET_DEV_INFO_e), // entry
                    Q_ACTION_NULL // zero terminator
                }
            };
            status_ = QM_TRAN(&tatbl_);
            break;
        }
        default: {
            status_ = QM_SUPER();
            break;
        }
    }
    return status_;
}
//$enddef${SMs::bt_SPC51} ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
//$define(SMs::remoteSM_ctor)
